files-upload-demo/files-upload-demo/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO `books` (`title`, `description`, `created_at`, `updated_at`) VALUES ('1231', '23132', '2017-09-17 13:46:31', '2017-09-17 13:46:31')

  def destroy
    @book.destroy
---
DELETE FROM `books` WHERE `books`.`id` = 1

  def set_book
    @book = Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1