sql-injection-demo/app/controllers/books_controller.rb

SELECT `books`.* FROM `books`
---
  def index
    @books = Book.all

INSERT INTO `books` (`title`, `description`, `created_at`, `updated_at`) VALUES ('Testing', '12', '2017-09-30 09:40:31', '2017-09-30 09:40:31')
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 0 LIMIT 1
---
  def set_book
    @book = Book.find(params[:id])